xml2груминг/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml2груминг/Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Начисления.Записывать = Истина;
	движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
    // Регистр "Начисления"
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета 			= ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало 	= ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец	= ТекСтрокаНачисления.ДатаОкончания;
		Движение.ПериодРегистрации 		= ПериодНачисления;
		Движение.БазовыйПериодНачало	= ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец 	= ТекСтрокаНачисления.ДатаОкончания;
		Движение.Сотрудник 				= ТекСтрокаНачисления.Сотрудник;
		Движение.График 				= ТекСтрокаНачисления.ГрафикРаботы;
		Движение.ПоказательРасчета 		= ТекСтрокаНачисления.ПоказательРасчета;
	КонецЦикла;  
	Движения.Начисления.Записать();
	Движения.Начисления.РассчитатьСуммуНачисления();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Начисления.Сотрудник КАК Сотрудник,
	               |	Начисления.Сумма КАК Сумма,
	               |	Начисления.ВидРасчета.СтатьяЗатрат КАК СтатьяЗатрат
	               |ИЗ
	               |	РегистрРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.Регистратор = &Регистратор
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	СтатьяЗатрат";
	Запрос.УстановитьПараметр("регистратор",Этотобъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
    ВыборкаИтогиПоСтатье = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    // Регистр "Учет затрат"
    Пока ВыборкаИтогиПоСтатье.Следующий() Цикл
        ДвижениеЗатрат = Движения.УчетЗатрат.Добавить();
        ДвижениеЗатрат.Период = Дата;
        ЗаполнитьЗначенияСвойств(ДвижениеЗатрат, ВыборкаИтогиПоСтатье);         
        // Регистр "Хозрасчетный" 
        ВыборкаДетальные = ВыборкаИтогиПоСтатье.Выбрать(); 
        Пока ВыборкаДетальные.Следующий() Цикл
            ДвижениеХозрасчетный = Движения.Хозрасчетный.Добавить();
            ДвижениеХозрасчетный.СчетДт        = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;
            ДвижениеХозрасчетный.СчетКт        = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
            ДвижениеХозрасчетный.Период        = Дата;
            ДвижениеХозрасчетный.Сумма        = ВыборкаДетальные.Сумма;
            ДвижениеХозрасчетный.Содержание    = "Отражено начисление заработной платы сотрудникам";
            БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетДт, 
                    ДвижениеХозрасчетный.СубконтоДт, ВыборкаДетальные.СтатьяЗатрат);
            БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетКт, 
                    ДвижениеХозрасчетный.СубконтоКт, ВыборкаДетальные.Сотрудник);
        КонецЦикла;    
    КонецЦикла;       
	
	
	
КонецПроцедуры
